
## Plan Result (terraform/aws/users)

[CI link](https://github.com/boxp/arch/actions/runs/8252512393)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * aws_iam_group.admin
  * aws_iam_group_policy_attachment.admin_policy_attachment
  * aws_iam_group_policy_attachment.force_mfa_attachment
  * aws_iam_policy.force_mfa


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_group.admin will be created
  + resource "aws_iam_group" "admin" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "admin"
      + path      = "/system/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_policy_attachment.admin_policy_attachment will be created
  + resource "aws_iam_group_policy_attachment" "admin_policy_attachment" {
      + group      = "admin"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
    }

  # aws_iam_group_policy_attachment.force_mfa_attachment will be created
  + resource "aws_iam_group_policy_attachment" "force_mfa_attachment" {
      + group      = "admin"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # aws_iam_policy.force_mfa will be created
  + resource "aws_iam_policy" "force_mfa" {
      + arn         = (known after apply)
      + description = "Policy that forces users to use MFA"
      + id          = (known after apply)
      + name        = "force-mfa"
      + name_prefix = (known after apply)
      + path        = "/system/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Condition = {
                          + BoolIfExists = {
                              + "aws:MultiFactorAuthPresent" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + NotAction = "iam:*"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = "iam:CreateVirtualMFADevice"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "iam:EnableMFADevice"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "iam:ResyncMFADevice"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "iam:ListVirtualMFADevices"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":44,"Program":"tfcmt","SHA1":"3bf7ae905d5ac047e72db2c9247affc0c7cb2f0a","Target":"terraform/aws/users","Vars":{},"WorkflowName":"pull_request_target"} -->